app/controllers/messages_controller.rb

  def set_group
     @group = Group.find(params[:group_id])
     @messages = @group.messages.includes(:user)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1