app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `name` = 'ooo', `updated_at` = '2017-08-10 08:21:16' WHERE `users`.`id` = 5
---
  def update
    user = User.find(params[:id])
    user.update(user_params) if user.id == current_user.id